package sec02.exam01;

public class Car {
	
	
	
	// 필드
	// 클래스 안에서 공통으로 사용할 변수 선언이 가능한 곳 
	// 변수 선 동시에 초기화는 가능함 
	// 따로 변수에 값을 변경하는 건 불가능함 
	
	String model = "임팔라";
	// model 변수 선언과 동시에 초기화 
	
	int speed;
	// 변수만 선언만 한 것 
	// 초기화를 하지 않은 경우 0 , false , null 로 자동으로 초기화 됨 
	// 변수만 선언했기 떄문에 speed의 값은 자동으로 0 
	
	// speed 변수의 값을 60을 바꾸는 행동 (바꾸는 걸 실행)
	// 필드영역에서는 실행(행동)하면 에러 
	// speed = 60;
	
	/////////////////////////////////////////////////////////////////////
	// 메소드 method 
	/*
	 * 리턴타입 : 메소드가 리턴하는 결과의 타입을 표시합니다 
	 * 메소드 이름 : 메소드의 기능이 드러나도록 식별자 규칙에 맞게 이름을 지어줍니다 
	 * 매개변수 선언 : 메소드를 실행할 때 필요한 데이터를 받기 위한 변수를 선언합니다 
	 * 메소드 실행 블록 : 실행할 코드를 작성 
	 * ex ) 리턴 타입 메소드 이름 (	[ 매개변수 선언 ] 	) {
	 * 					실행할 코드를 작성하는 곳  
	 * 			}
	 * ex2 ) void powerOn(){}
	 * 		 double divide ( int x , int y ) {}
	 *  메소드 이름을 소문자로 적는게 불문율 
	 *  
	 *  void 아무것도 줄 게 없는 경우 void 적어주면 됨 void : 공허한 
 	 */		 				 


}
